[
  {
    "location": "The Richmond Rooms, St Nicholas Street, Aberdeen",
    "Latitude and longitude": "57.147016, -2.097748",
    "lat": 57.147016,
    "lng": -2.097748,
    "pin-title": "The Richmond Rooms, St Nicholas Street",
    "text": "On 19 February 1913 Louisa Lumsden LLD, president of the Aberdeen Association for Women’s Suffrage, gave a speech on the subject of ‘Why Should Not Women be Citizens?’ to the Caledonian Order of the Oddfellows Past Masters’ Association.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Stoneywood, Aberdeen",
    "Latitude and longitude": "57.191360,-2.222570",
    "lat": 57.19136,
    "lng": -2.222572,
    "pin-title": "Stoneywood",
    "text": "A meeting of the Stoneywood Literary Guild, which took place on 14 January 1914, was addressed by Miss Coutts, a member of the Aberdeen University Suffrage Association on the subject of ‘Co-Partners – Women’s Position in the State’. According to the report published a few days later in the Aberdeen Daily Journal, Miss Coutts was introduced and supported by Miss Jackson, infant mistress of the Stoneywood Public School, and a vote of thanks was given by Miss Stewart, of Old Schoolhouse.",
    "photos": "https://s3.geograph.org.uk/geophotos/04/44/74/4447459_1b39b88d_1024x1024.jpg",
    "captions": ""
  },
  {
    "location": "Broad Hill, Aberdeen",
    "Latitude and longitude": "57.159290,-2.131480",
    "lat": 57.156803,
    "lng": -2.083501,
    "pin-title": "Broad Hill",
    "text": "Miss Emily Foggo, of the non-militant National Union of Women’s Suffrage Societies, addressed a large crowd on the Broad Hill, Aberdeen, on 17 June 1914. She spoke on the question ‘Will votes for women help salve social questions?’ and argued that issues such as housing, the milk supply and other domestic questions needed a female voice because men had little knowledge of such problems.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Castlegate Aberdeen",
    "Latitude and longitude": "57.148232,-2.092735",
    "lat": 57.148232,
    "lng": -2.092735,
    "pin-title": "Castlegate",
    "text": "A large open-air meeting at the Castlegate on 27 July 1914 heard the well-known surgeon Sir Victor Horsley and his wife, Lady Horsley, protest against the forcible feeding of the suffragettes. The meeting was organised by the Aberdeen branch of the NUWSS – the non-militant suffrage organisation. Also on the platform were Professor Trail, Professor of Botany, and Professor J. Arthur Thomson, Professor of Natural History, of Aberdeen University.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Sir_Victor_Horsley._Photograph_by_G.C._Beresford._Wellcome_V0028720.jpg https://upload.wikimedia.org/wikipedia/commons/5/50/Castle_Street_and_municipal_buildings_Aberdeen_Scotland.jpg",
    "captions": "Sir Victor Horsley"
  },
  {
    "location": "Castlegate Aberdeen",
    "Latitude and longitude": "57.148232,-2.092735",
    "lat": 57.148232,
    "lng": -2.092735,
    "pin-title": "Castlegate",
    "text": "In February 1907, Annie Kenney and Helen Fraser addressed an open-air crowd in Castle Street. Annie Kenney had arrived that day from London and was supposed to have come to Aberdeen with Emmeline and Christabel Pankhurst to campaign in the south Aberdeenshire by-election. However, the two Pankhursts had been arrested during a raid on the House of Commons. Kenney explained that she had spoken at a meeting in Caxton Hall in London before the raid, but she had been 'held back from the fray' by the committee because she had 'the special duty before her of appearing in Aberdeen'. In her speech in Castle Street she described in detail events of the previous day in London. Annie Kenney, a mill girl from Manchester, was unusual in being a working-class leader in the WSPU. Kenney and Christabel Pankhurst had been the first suffragettes to be sent to prison for refusal to pay a fine after disturbing a political meeting in 1905.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Annie_Kenney%2C_1909.jpg",
    "captions": "Annie Kenney"
  },
  {
    "location": "The Queen’s Cinema, 120 Union Street, Aberdeen",
    "Latitude and longitude": "57.146311, -2.099830",
    "lat": 57.146311,
    "lng": -2.09983,
    "pin-title": "The Queen's Cinema",
    "text": "The showing of the film A Militant Suffragette starring the Danish film actress Asta Nielsen was disrupted on 4 February 1914 by a group of women’s suffrage supporters. They hissed and stamped their feet and several left the cinema altogether during the part of the film in which Nielsen was force-fed.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/7/75/Asta_Nielsen.jpg",
    "captions": "Asta Neilsen"
  },
  {
    "location": "Exchange Street, Aberdeen",
    "Latitude and longitude": "57.145700,-2.097020",
    "lat": 57.1457,
    "lng": -2.09702,
    "pin-title": "Exchange Street",
    "text": "Miss Gawthorpe of the Women’s Social and Political Union (WSPU) addressed a crowd of 200-300 farmers in Exchange Street on 17 April 1908.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Mary_Gawthorpe%2C_1908._%2822358671834%29.jpg",
    "captions": ""
  },
  {
    "location": "Fish Market, Aberdeen",
    "Latitude and longitude": "57.143842, -2.089903",
    "lat": 57.143842,
    "lng": -2.089903,
    "pin-title": "Fish Market",
    "text": "Mary Molony of the Women’s Freedom League addressed a meeting at the Fish Market on 17 April 1908. According to the Dundee Courier’s report of the meeting, a German skipper shouted insults at her in German – she replied in the same language telling him to go home, where women were starting a similar movement.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/d/d4/FMIB_33025_Aberdeen_Fish_Market.jpeg",
    "captions": ""
  },
  {
    "location": "Rubislaw Den House, Aberdeen",
    "Latitude and longitude": "57.144616, -2.138143",
    "lat": 57.144616,
    "lng": -2.138143,
    "pin-title": "Rubislaw Den House",
    "text": "A news story in the Dundee Courier of 27 June 1913 reported that suffragettes had vandalised the garden of the house belonging to Provost Adam Maitland in Rubislaw Den. According to the newspaper report, the raiders pulled up a number of valuable plants and then arranged a long hosepipe in the shape of the words ‘Votes for Women’.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Rubislaw Den North, Aberdeen",
    "Latitude and longitude": "57.144616, -2.138143",
    "lat": 57.144616,
    "lng": -2.138143,
    "pin-title": "Rubislaw Den North",
    "text": "Miss Humphries attacked a motor car in Rubislaw Den North on the occasion of Lloyd George’s visit to the city in November 1912. She stepped onto the footboard of the motorcar and threw a stone through the glass. She thought that Lloyd George was in the car.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Craiginches Prison, Aberdeen",
    "Latitude and longitude": "57.133580,-2.089080",
    "lat": 57.13358,
    "lng": -2.08908,
    "pin-title": "Craiginches Prison",
    "text": "Four suffragettes went on hunger strike in Craiginches Prison in December 1912, having been sentenced to prison for attempts to disrupt the visit of the Chancellor of the Exchquer, David Lloyd George, to the city. The four – Miss Humphries, Marion Pollock, Fanny Parker and Joyce Locke – were treated as political prisoners by the prison rather than being placed in the second division where common criminals were held.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Train Station, Aberdeen",
    "Latitude and longitude": "57.144910,-2.097210",
    "lat": 57.14491,
    "lng": -2.09721,
    "pin-title": "Train Station",
    "text": "Emily Wilding Davison attacked a Baptist Minister, Rev Forbes Jackson, in the corridor of a Caledonian train waiting at a platform at the train station in December 1912. Jackson had been seeing his son off on the train. Davison was under the impression that he was the Chancellor of the Exchequer, Lloyd George, who was visiting the city. Davison attacked Jackson with a dog whip, striking him on the head and shoulders and shaking him at the collar of his coat. She later punched him in the jaw, despite being in the hands of the police by that time.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Emily_Wilding_Davison.jpg",
    "captions": ""
  },
  {
    "location": "Marischal College, Aberdeen",
    "Latitude and longitude": "57.148821,-2.097135",
    "lat": 57.148821,
    "lng": -2.097135,
    "pin-title": "Marischal College",
    "text": "A meeting of the Aberdeen University Women’s Suffrage Association, held at Marischal College on 16 May 1908, was disrupted by a crowd of male students. The meeting was held to hear addresses from Mary Gawthorpe and Helen Fraser, both members of the WSPU, who had taken prominent roles in the WSPU campaigns at several recent Scottish by-elections. WSPU policy was to oppose the Liberal candidate in all by-elections in order to reduce the Liberal government majority.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Marischalcollege1.jpg",
    "captions": ""
  },
  {
    "location": "Mechanics Hall, Market Street",
    "Latitude and longitude": "57.146296,-2.096776",
    "lat": 57.146296,
    "lng": -2.096776,
    "pin-title": "Mechanics Hall",
    "text": "A meeting was held at the Mechanics Hall in 16 December 1872 to hear an address on ‘Women’s Suffrage in its Educational and Industrial Aspects’ by Mary Beedy of St Louis, USA.",
    "photos": "https://s0.geograph.org.uk/geophotos/05/43/50/5435028_a19ad1d2_1024x1024.jpg",
    "captions": ""
  },
  {
    "location": "Music Hall, Union Street",
    "Latitude and longitude": "57.145115,-2.104694",
    "lat": 57.145115,
    "lng": -2.104694,
    "pin-title": "Music Hall",
    "text": "The Aberdeen Association for Women’s Suffrage (Constitutional and Non-Militant) held a meeting at the Music Hall 3 November 1909.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Facade_of_the_Music_Hall%2C_Aberdeen_%28geograph_3110454%29.jpg",
    "captions": ""
  },
  {
    "location": "Music Hall, Aberdeen",
    "Latitude and longitude": "57.145115,-2.104694",
    "lat": 57.145115,
    "lng": -2.104694,
    "pin-title": "Music Hall",
    "text": "Helen Crawfurd addressed a meeting at the Music Hall on 26 February 1914 in defence of the suffragettes’ militancy.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Helen_Crawfurd_%28cropped%29.jpg",
    "captions": ""
  },
  {
    "location": "Music Hall, Aberdeen",
    "Latitude and longitude": "57.145115,-2.104694",
    "lat": 57.145115,
    "lng": -2.104694,
    "pin-title": "Music Hall",
    "text": "A meeting was held in the Music Hall on 3 April 1914 to hear a defence of militant suffragette actions. Mrs Blair of East Lothian spoke while Mrs Innes chaired the meeting.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/5/57/Fanny_Parker%2C_suffragette%2C_1914.jpg",
    "captions": "Fanny Parker"
  },
  {
    "location": "Music Hall, Aberdeen",
    "Latitude and longitude": "57.145115,-2.104694",
    "lat": 57.145115,
    "lng": -2.104694,
    "pin-title": "Music Hall",
    "text": "In December 1907, a Liberal party meeting held at the Music Hall to hear the Chancellor of the Exchequer, Asquith, was disrupted by suffragettes led by Emmeline Pankhurst and the honorary secretary of the Aberdeen WSPU branch Caroline Phillips.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/2/25/Emmeline_Pankhurst%2C_seated_%281913%29.jpg",
    "captions": ""
  },
  {
    "location": "Music Hall, Aberdeen",
    "Latitude and longitude": "57.145115,-2.104694",
    "lat": 57.145115,
    "lng": -2.104694,
    "pin-title": "Music Hall",
    "text": "In November 1912, the Aberdeen Daily Journal reported the sensational news that three suffragettes had been found concealed in the Music Hall a few hours before a speech was to be made by the Chancellor of the Exchequer Lloyd George. The suffragettes were described as having ‘explosive bombs’ in their possession, although in fact these bombs were merely explosive caps from toy guns. The suffragettes gave their names as Marion Pollock, Fanny Parker and Joyce Locke. Fanny Parker was later revealed to be the niece of the war hero Lord Kitchener. In July 1914 she attempted to set fire to Burns’ Cottage.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/5/57/Fanny_Parker%2C_suffragette%2C_1914.jpg",
    "captions": ""
  },
  {
    "location": "474 Union Street, Aberdeen",
    "Latitude and longitude": "57.143183, -2.111065",
    "lat": 57.143183,
    "lng": -2.111065,
    "pin-title": "474 Union Street",
    "text": "The address of the NUWSS Suffrage Shop in Aberdeen in 1912. The NUWSS was the constitutional, non-militant suffragist organisation – the National Union of Women’s Suffrage Societies.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/b/b1/NUWSS_poster.PNG",
    "captions": ""
  },
  {
    "location": "214 Union Street, Aberdeen",
    "Latitude and longitude": "57.144559, -2.106097",
    "lat": 57.144559,
    "lng": -2.106097,
    "pin-title": "214 Union Street",
    "text": "Address used for correspondence of the Aberdeen Association for Women’s Suffrage (affiliated to the National Union) in 1912.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "173a Union Street, Aberdeen",
    "Latitude and longitude": "57.145442, -2.102659",
    "lat": 57.145442,
    "lng": -2.102659,
    "pin-title": "173a Union Street",
    "text": "Address used for correspondence of the Women’s Freedom League in 1908.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "41½ Union Street, Aberdeen",
    "Latitude and longitude": "57.147338, -2.095943",
    "lat": 57.147338,
    "lng": -2.095943,
    "pin-title": "41½ Union Street",
    "text": "Correspondence address of the WSPU in Aberdeen in 1909 – after Caroline Phillips was removed from her role as Honorary Secretary of the Aberdeen branch.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "7 Bon-Accord Street, Aberdeen",
    "Latitude and longitude": "57.144167, -2.106552",
    "lat": 57.144167,
    "lng": -2.106552,
    "pin-title": "7 Bon-Accord Street",
    "text": "The WSPU had rooms in Bon-Accord Street in 1912. Lilias Mitchell was organiser of the WSPU branch at this time.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "11a Dee Street, Aberdeen",
    "Latitude and longitude": "57.144425, -2.104337",
    "lat": 57.144425,
    "lng": -2.104337,
    "pin-title": "11a Dee Street",
    "text": "By 1914 the offices of the Aberdeen Association for Women’s Suffrage had moved to Dee Street. At the outbreak of the war in August 1914 the Association offered their offices to the Soldiers’ and Sailors’ Families Association, but they were considered unsuitable.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Broad Street, Aberdeen",
    "Latitude and longitude": "57.148183, -2.096097",
    "lat": 57.148183,
    "lng": -2.096097,
    "pin-title": "Broad Street",
    "text": "The offices of the Aberdeen Daily Journal in Broad Street were used as the postal address of the Aberdeen branch of the WSPU from 1907 to early 1909. This was because the honorary secretary of the Aberdeen WSPU at this time was Caroline Phillips, who also worked as a journalist at the Daily Journal. Phillips’ correspondence demonstrates that she used Daily Journal and Aberdeen Evening Express notepaper for her WSPU work and also made free with the Journal telegram facilities and address to further her suffragette activities, despite warnings from the newspaper management.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Aberdeen Public Library, Rosemount Viaduct",
    "Latitude and longitude": "57.147862,-2.106340",
    "lat": 57.147862,
    "lng": -2.10634,
    "pin-title": "Aberdeen Public Library",
    "text": "The Dundee Courier reported an interesting story in May 1913 about a boy scout chasing away a suspected suffragette who visited the Public Library building on Rosemount Viaduct. The scout recognised the lady visitor to the library as someone who had been involved in suffragette militancy when Lloyd George visited the city in November 1912. He also noted her ‘suspicious’ handbag. Noticing herself to be watched, the woman left the library but was seen a few hours later sketching the building from Union Terrace.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/8/85/Aberdeen_Central_Library.jpg",
    "captions": ""
  },
  {
    "location": "Forest Avenue and Salisbury Terrace, Aberdeen",
    "Latitude and longitude": "57.135602, -2.127283",
    "lat": 57.135602,
    "lng": -2.127283,
    "pin-title": "Forest Avenue",
    "text": "When the post boxes on Forest Avenue and Salisbury Terrace were opened by postmen for the 9 o’clock collection on 9 April 1913, they found that a thick black liquid, containing sawdust, had been poured into the boxes. The liquid had saturated the letters and parcels in the box and obliterated the addresses on the envelopes. Suffragettes were suspected.",
    "photos": "https://s0.geograph.org.uk/geophotos/02/35/94/2359420_d4e53a55.jpg",
    "captions": ""
  },
  {
    "location": "Fountainhall Road, Aberdeen",
    "Latitude and longitude": "57.144883, -2.128102",
    "lat": 57.144883,
    "lng": -2.128102,
    "pin-title": "Fountainhall Road",
    "text": "When the pillar box on Fountainhall Road was opened on 1 March 1913 it was found that black ink had been poured inside. Since pillar boxes were a popular target for the suffragettes it was assumed that they had been responsible.",
    "photos": "https://s0.geograph.org.uk/geophotos/03/90/21/3902102_f5670951.jpg",
    "captions": ""
  },
  {
    "location": "Wallace Statue, Union Street, Aberdeen",
    "Latitude and longitude": "57.147562,-2.105048",
    "lat": 57.147562,
    "lng": -2.105048,
    "pin-title": "Wallace Statue",
    "text": "The Dundee suffragette Mary Pollock Grant spoke at the Wallace Statue on Union Street on 12 November 1913. She had been in Aberdeen to disrupt a meeting held at the Music Hall to hear T. P. O’Connor, the Irish Nationalist MP. However, she admitted that this was not her first meeting to Aberdeen – she had also been there in November 1912 when the suffragettes attempted to disrupt a meeting to hear the Chancellor Lloyd George the same venue. In her speech, Grant attacked the so-called ‘Cat and Mouse Act’, that allowed prisons to release suffragettes who had gone on hunger strike and then re-arrest them when they had been nursed back to health. The statue is now positioned on Rosemount Viaduct.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/6/64/William_Wallace_Statue_%2C_Aberdeen.jpg",
    "captions": ""
  },
  {
    "location": "West End Café, 154A Union Street, Aberdeen",
    "Latitude and longitude": "57.145314, -2.103431",
    "lat": 57.145314,
    "lng": -2.103431,
    "pin-title": "West End Café",
    "text": "The Aberdeen Women’s Social and Political Union (the WSPU – otherwise known as the suffragettes) held an ‘At Home’ at the West End Café in Aberdeen on the night of 4 March 1908. Around 100 men and women took part. Speakers included Mrs Webster, wife of the socialist Unitarian minister Rev Alexander Webster, and the treasurer of the branch, Mrs Innes. Mrs Innes spoke on the achievement of women’s suffrage in other parts of the world. Women’s suffrage campaigners often pointed to countries such as New Zealand and Australia where women already had the vote to demonstrate how women could handle citizenship and vote responsibly.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "YMCA, 198 Union Street, Aberdeen",
    "Latitude and longitude": "57.144874,-2.105144",
    "lat": 57.144874,
    "lng": -2.105144,
    "pin-title": "YMCA, 198 Union Street",
    "text": "A meeting of the Aberdeen Association for Women’s Suffrage was held in the Upper Hall of the YMCA on 1 March 1904. Mrs Ramsey, presiding, noted that, through the influence of the Association, two women had been elected to the Aberdeen School Board. The meeting then heard a talk by Alison Garland from London on the subject of women’s suffrage.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "2 South Esplanade, Torry, Aberdeen",
    "Latitude and longitude": "57.138676,-2.087245",
    "lat": 57.138676,
    "lng": -2.087245,
    "pin-title": "2, South Esplanade",
    "text": "During the 1908 Kincardineshire by-election, the WSPU (Women’s Social and Political Union, commonly called the Suffragettes) took an office at this address in Torry.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "St Andrew’s Hall, Palmerston Road, Aberdeen",
    "Latitude and longitude": "57.141593, -2.095688",
    "lat": 57.141593,
    "lng": -2.095688,
    "pin-title": "Palmerston Road",
    "text": "A meeting held by the WSPU took place in St Andrew’s Hall during the Kincardineshire by-election campaign in April 1908. Helen Fraser and Mary Phillips, both from Glasgow, were the speakers and appealed to the electors of Kincardineshire to vote against the Liberal candidate in order to send a message to the Liberal government that it needed to give women the votes.",
    "photos": "https://assets3.parliament.uk/iv/ig-portrait-large//ImageVault/Images/scope_0/filename_lh6ut_oQugnQTNYEwJH6.jpg/storage_Edited/ImageVaultHandler.aspx.jpg",
    "captions": ""
  },
  {
    "location": "Menzies Road, Torry, Aberdeen",
    "Latitude and longitude": "57.137045, -2.090938",
    "lat": 57.137045,
    "lng": -2.090938,
    "pin-title": "Menzies Road",
    "text": "A meeting held by the WSPU took place in Menzies Road during the Kincardineshire by-election campaign in April 1908. It was addressed by Mary Phillips of the WSPU.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/2/26/Suffragette_Mary_Phillips_1909._Blathwayt%2C_Col_Linley.jpg",
    "captions": ""
  },
  {
    "location": "Duthie Park, Aberdeen",
    "Latitude and longitude": "57.130640,-2.110900",
    "lat": 57.13064,
    "lng": -2.1109,
    "pin-title": "Duthie Park",
    "text": "On the night of 7 April 1913 the turf of Duthie Park was damaged with the words ‘Release Mrs Pankhurst’ cut into the grass just in front of the Palmhouse. According to reports in the newspapers, the letters measured around 12 feet by 3 feet. The slogan ‘Votes for Women’ was painted on the door of the Palmhouse in black paint.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Ashley Road Public School, Aberdeen",
    "Latitude and longitude": "57.138418,-2.122905",
    "lat": 57.138418,
    "lng": -2.122905,
    "pin-title": "Ashley Road Public School",
    "text": "On the night of 2 May 1913 one of the new buildings at the school was damaged by fire. The roof was almost completely destroyed. According to the Aberdeen Daily Journal, police found evidence of arson and two copies of the WSPU newspaper The Suffragette, carefully placed away from the flames.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Ashley_Road_School.png",
    "captions": ""
  },
  {
    "location": "The Market Stance, Laurencekirk",
    "Latitude and longitude": "56.834398, -2.463833",
    "lat": 56.834398,
    "lng": -2.463833,
    "pin-title": "Market Stance, Laurencekirk",
    "text": "The Market Stance in Laurencekirk saw speeches from two different militant suffrage organisations on 13 April 1908. Firstly onlookers were treated to a speech by Mary Gawthorpe of the WSPU. When she had finished, Teresa Billington-Greig of the Women’s Freedom League arrived and spoke to the assembled crowd.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/4/43/Teresa_Billington_Greig.jpg",
    "captions": "Teresa Billington-Greig"
  },
  {
    "location": "The Public Hall, Monboddo Street, Auchenblae",
    "Latitude and longitude": "56.898046, -2.449834",
    "lat": 56.898046,
    "lng": -2.449834,
    "pin-title": "Public Hall, Auchenblae",
    "text": "A meeting of the Women’s Freedom League took place in Auchenblae during the April 1908 Kincardineshire by-election campaign. The meeting was addressed by Anna Munro and Amy Sanderson.",
    "photos": "https://s3.geograph.org.uk/geophotos/05/91/25/5912587_b9c0fe69_1024x1024.jpg",
    "captions": ""
  },
  {
    "location": "The Quay, Stonehaven Old Town",
    "Latitude and longitude": "56.960692, -2.202115",
    "lat": 56.960692,
    "lng": -2.202115,
    "pin-title": "The Quay, Stonehaven",
    "text": "A meeting of the WSPU took place in Stonehaven during the April 1908 Kincardineshire by-election campaign. The Aberdeen Daily Journal reported that the audience was comprised mainly of fisher folk. It was addressed by Una Dugdale and Miss Seymour while Maud Joachim took the chair.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Una_Dugdale_Duval_speaking_in_Newcastle_election_in_1908.jpg",
    "captions": "Una Dugdale"
  },
  {
    "location": "Market Square, Stonehaven",
    "Latitude and longitude": "56.964069,-2.209450",
    "lat": 56.964069,
    "lng": -2.20945,
    "pin-title": "Market Square, Stonehaven",
    "text": "A meeting of the WSPU took place in Stonehaven during the April 1908 Kincardineshire by-election campaign. The Dundee Courier reported that an altercation took place between Mary Gawthorpe of the WSPU and Jane Key Ford of Glasgow, a Good Templar agent. Ford accused the suffragettes of not caring about purity, morality and righteousness because of their support for barmaids. Mary Gawthorpe pointed out in response that she was a temperance reformer as well as a suffragist.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Stonehaven_towncenter.jpg",
    "captions": ""
  },
  {
    "location": "Auction Mart, Stonehaven",
    "Latitude and longitude": "56.964069,-2.209450",
    "lat": 56.964069,
    "lng": -2.20945,
    "pin-title": "Auction Mart, Stonehaven",
    "text": "A meeting of the Women’s Freedom League took place in Stonehaven Auction Mart during the April 1908 Kincardineshire by-election campaign. The speakers included Teresa Billington-Greig and Mary Molony.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Town Hall, 1 Kinneskie Lane, Banchory",
    "Latitude and longitude": "57.051256, -2.506467",
    "lat": 57.051256,
    "lng": -2.506467,
    "pin-title": "Town Hall, Banchory",
    "text": "A meeting of the Women’s Freedom League took place in Banchory during the April 1908 Kincardineshire by-election campaign. Teresa Billington-Greig and Amy Sanderson addressed the meeting.",
    "photos": "https://s1.geograph.org.uk/geophotos/05/88/52/5885221_49b13f60_1024x1024.jpg",
    "captions": ""
  },
  {
    "location": "Public School, Raemoir",
    "Latitude and longitude": "57.053565, -2.489702",
    "lat": 57.053565,
    "lng": -2.489702,
    "pin-title": "Public School, Raemoir",
    "text": "A meeting of the WSPU took place in Raemoir during the April 1908 Kincardineshire by-election campaign. The meeting was addressed by Miss Macaulay, possibly Florence Macaulay, who was WSPU organiser in Edinburgh during 1909.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Town Hall, Macduff",
    "Latitude and longitude": "57.669746,-2.498810",
    "lat": 57.669746,
    "lng": -2.49881,
    "pin-title": "Town Hall, Macduff",
    "text": "A NUWSS meeting was held in Macduff on 25 July 1912 to hear Louisa Innes Lumsden speak. According to the report in the Aberdeen Daily Journal, it was explained at the start of the meeting that the NUWSS were non-militant and had no party affiliations. The meeting was also attended by Alice Crompton and Edith Bisset of the NUWSS. Crompton was an organiser of the NUWSS in the area, based in a NUWSS shop in Aberdeen. Ex-Provost West presided at the meeting.",
    "photos": "http://i.rcahms.gov.uk/canmore/l/SC00946653.jpg",
    "captions": ""
  },
  {
    "location": "The Links, Peterhead",
    "Latitude and longitude": "57.503833,-1.791038",
    "lat": 57.503833,
    "lng": -1.791038,
    "pin-title": "The Links, Peterhead",
    "text": "Miss Emily Foggo, of the National Union of Women's Suffrage Societies (NUWSS) addressed a large crowd on the links on 13 July 1914. She asked the electors of Peterhead to help the suffragettes fight their battle and noted that she thought it was the working women who needed the vote more than women of leisure. Emily Foggo’s father had been the factor of the Invercauld estates, but the family later moved to Edinburgh. Emily became involved in the women’s suffrage campaign in that city and was in charge of the Bathgate, West Lothian, branch of the constitutional suffragists.",
    "photos": "" ,
    "captions": ""
  },
  {
    "location": "Balmoral golf course and memorial fountain",
    "Latitude and longitude": "57.041929, -3.228742",
    "lat": 57.041929,
    "lng": -3.228742,
    "pin-title": "Balmoral Golf Course",
    "text": "On the morning of Saturday 7 September 1912, it was discovered that the Balmoral golf course had been attacked by the suffragettes. The flags at each hole had been replaced by purple ones bearing the slogans ‘Cabinet Ministers, stop forcibly feeding women’ and ‘Votes for women means peace for Cabinet Ministers’. The suffragettes also attacked the memorial fountain erected by the side of the south Ballater and Braemar road, painting on it ‘Cabinet Ministers are responsible for the present actions’.",
    "photos": "",
    "captions": ""
  },
  {
    "location": "Music Hall, Peterhead",
    "Latitude and longitude": "57.507314,-1.783765",
    "lat": 57.507314,
    "lng": -1.783765,
    "pin-title": "Music Hall, Peterhead",
    "text": "Emmeline Pankhurst addressed an audience at the Music Hall in Peterhead in September 1911. The meeting was one of a series of meetings held in Scotland in support of the Conciliation Bill, which would have allowed some property-owning women to qualify for the Parliamentary vote. She was introduced by John E. Sutherland, the Liberal MP for Elgin Burghs. Before Mrs Pankhurst addressed the meeting, Aberdeenshire suffragette Una Dugdale gave a solo performance of ‘The March of the Women’, composed by Ethel Smyth and first performed earlier that year. The Conciliation Bill was ‘torpedoed’ by Asquith’s announcement of a manhood suffrage bill which could be amendable to allow some women the vote. Such a bill was introduced in 1912 but made no progress.",
    "photos": "https://upload.wikimedia.org/wikipedia/commons/2/25/Emmeline_Pankhurst%2C_seated_%281913%29.jpg",
    "captions": ""
  },
  {
    "location": "Dalrymple Hall, Fraserburgh",
    "Latitude and longitude": "57.6907806,-2.0062767",
    "lat": 57.6907806,
    "lng": -2.0062767,
    "pin-title": "Dalrymple Hall, Fraserburgh",
    "text": "Emmeline Pankhurst addressed an audience at the Dalrymple Hall in Fraserburgh in September 1911. The meeting was one of a series of meetings held in Scotland in support of the Conciliation Bill, which would have allowed some property-owning women to qualify for the Parliamentary vote. Mrs Pankhurst was introduced at the meeting by the Unionist Andrew Tarras.",
    "photos": "https://s0.geograph.org.uk/geophotos/05/80/90/5809080_ac51cdcf_1024x1024.jpg",
    "captions": ""
  }
]
